{
  "hu": {
    "site_title": "II. Világháború Szimulátor & Információk",
    "main_heading": "II. Világháború: Történelem és Szimuláció",
    "nav_home": "Kezdőlap",
    "nav_timeline": "Idővonal",
    "nav_key_figures": "Fontos Személyek",
    "nav_battles": "Csaták",
    "nav_simulation": "Szimuláció",
    "nav_hungary": "Magyarország a II. VH-ban",
    "home_title": "Üdvözöllek a II. Világháború Interaktív Oldalán!",
    "home_intro_1": "Fedezd fel a XX. század legmeghatározóbb konfliktusát! Ez az oldal 7. osztályos tananyag alapján nyújt betekintést a Második Világháború eseményeibe, szereplőibe és következményeibe. Az információk általánosak, az országspecifikus tantervek eltérhetnek.",
    "home_intro_2": "Használd a fenti menüt a navigáláshoz, vagy állítsd be a szimulációt és próbáld ki az interaktív részt. Jó felfedezést!",
    "home_settings_title": "Szimulációs Beállítások",
    "home_settings_text": "Válaszd ki a szimuláció alapvető paramétereit. Ezek a beállítások befolyásolják a 'Szimuláció' fülön megjelenő forgatókönyveket és interakciókat.",
    "setting_side": "Válassz oldalt:",
    "side_allies": "Szövetségesek",
    "side_axis": "Tengelyhatalmak",
    "setting_focus": "Válassz hadszínteret:",
    "focus_europe": "Európa (Nyugati Front)",
    "focus_eastern_front": "Keleti Front (Európa)",
    "focus_pacific": "Csendes-óceán",
    "setting_difficulty": "Válassz nehézséget:",
    "difficulty_easy": "Könnyű",
    "difficulty_normal": "Normál",
    "difficulty_hard": "Nehéz",
    "apply_settings_button": "Beállítások Alkalmazása és Mentése",
    "settings_applied_message": "Beállítások elmentve! Navigálj a Szimuláció fülre.",
    "settings_not_set_simulation": "Kérjük, először állítsd be a szimulációs paramétereket a Kezdőlapon a forgatókönyv megtekintéséhez!",
    "scenario_not_available": "Ehhez a beállítás kombinációhoz jelenleg nem érhető el forgatókönyv. Kérjük, válassz más beállításokat a Kezdőlapon.",
    "timeline_title": "A II. Világháború Idővonala",
    "timeline_intro": "Kövesd végig a háború legfontosabb eseményeit kronologikus sorrendben.",
    "event_1939_09_01_date": "1939. Szeptember 1.",
    "event_1939_09_01_desc": "Németország lerohanja Lengyelországot, a háború kezdete Európában.",
    "event_1940_05_10_date": "1940. Május 10.",
    "event_1940_05_10_desc": "Német támadás Franciaország és a Benelux államok ellen (villámháború).",
    "event_1941_06_22_date": "1941. Június 22.",
    "event_1941_06_22_desc": "A Barbarossa-hadművelet: Németország megtámadja a Szovjetuniót.",
    "event_1941_12_07_date": "1941. December 7.",
    "event_1941_12_07_desc": "Japán támadás Pearl Harbor ellen; az USA belép a háborúba.",
    "event_1944_06_06_date": "1944. Június 6.",
    "event_1944_06_06_desc": "A normandiai partraszállás (D-nap), a nyugati front megnyitása.",
    "event_1945_05_08_date": "1945. Május 8.",
    "event_1945_05_08_desc": "A háború vége Európában (VE-nap).",
    "event_1945_09_02_date": "1945. Szeptember 2.",
    "event_1945_09_02_desc": "Japán kapitulációja, a II. világháború hivatalos vége.",
    "key_figures_title": "A Háború Kulcsfigurái",
    "key_figures_intro": "Ismerd meg azokat a vezetőket és személyiségeket, akik formálták a háború menetét.",
    "figure_churchill_name": "Winston Churchill",
    "figure_churchill_role": "Nagy-Britannia miniszterelnöke",
    "figure_churchill_desc": "Legendás szónok, aki országa ellenállását vezette a náci Németországgal szemben.",
    "figure_roosevelt_name": "Franklin D. Roosevelt",
    "figure_roosevelt_role": "Az Amerikai Egyesült Államok elnöke",
    "figure_roosevelt_desc": "Vezette az USA-t a háború nagy részében, kulcsszerepet játszott a Szövetségesek győzelmében.",
    "figure_stalin_name": "Joszif Sztálin",
    "figure_stalin_role": "A Szovjetunió vezetője",
    "figure_stalin_desc": "Diktatórikus vezető, akinek országa óriási áldozatok árán állította meg a német előrenyomulást a keleti fronton.",
    "figure_hitler_name": "Adolf Hitler",
    "figure_hitler_role": "Németország Führere",
    "figure_hitler_desc": "A náci párt vezetője, a II. világháború és a Holokauszt fő felelőse.",
    "battles_title": "Meghatározó Csaták",
    "battles_intro": "Ismerj meg néhányat a II. világháború legfontosabb és legvéresebb ütközetei közül.",
    "battle_stalingrad_name": "Sztálingrádi csata (1942-43)",
    "battle_stalingrad_desc": "Fordulópont a keleti fronton. A Vörös Hadsereg itt állította meg és fordította vissza a német előrenyomulást.",
    "battle_normandy_name": "Normandiai partraszállás (1944)",
    "battle_normandy_desc": "A szövetséges erők partraszállása Franciaországban, ami megnyitotta a nyugati frontot és felgyorsította Németország vereségét.",
    "simulation_title": "Interaktív Forgatókönyvek",
    "simulation_intro": "Ez a rész a Kezdőlapon beállított paraméterek alapján kínál interaktív forgatókönyveket. A döntéseid befolyásolják a leírt kimenetelt.",
    "simulation_current_settings_title": "Aktuális Szimulációs Beállítások",
    "simulation_current_side": "Választott oldal",
    "simulation_current_focus": "Választott hadszíntér",
    "simulation_current_difficulty": "Választott nehézség",
    "simulation_scenario_title": "Forgatókönyv",
    "simulation_your_choice": "Választásod:",
    "simulation_outcome_title": "Következmény:",
    "scenario_choose_option": "Válassz egy opciót a folytatáshoz:",
    "scenario_allies_europe_1944_title": "D-nap Előkészületei (Szövetségesek, Európa - Nyugati Front, 1944)",
    "scenario_allies_europe_1944_desc": "1944 tavasza. Te a Szövetséges Főparancsnokság tagja vagy, a normandiai partraszállás (Overlord hadművelet) végső tervezési fázisában. Két fő terület merül fel lehetséges partraszállási zónaként: Normandia partjai vagy a Pas-de-Calais régió, amely közelebb van Angliához és Németországhoz, de jobban védett. A hírszerzés vegyes. Hová összpontosítanád a fő támadást?",
    "scenario_allies_europe_1944_choice1": "Normandia: Meglepetésszerűbb, de hosszabb utánpótlási vonalak.",
    "scenario_allies_europe_1944_choice2": "Pas-de-Calais: Rövidebb út, de erősebb német védelem várható.",
    "scenario_allies_europe_1944_outcome1_easy": "A normandiai partraszállás meglepi a németeket. Bár az utánpótlás nehézkes, a kezdeti sikerek megalapozzák a hídfőállást. A veszteségek mérsékeltek, a front gyorsan megnyílik.",
    "scenario_allies_europe_1944_outcome1_normal": "A normandiai partraszállás sikeresen meglepi a németeket, de a védelem helyenként kemény. Az utánpótlás kiépítése kritikus. A hídfőállás biztosítása jelentős erőfeszítést igényel, de végül stabilizálódik.",
    "scenario_allies_europe_1944_outcome1_hard": "A normandiai partraszállás kezdetben sikeres a meglepetés miatt, de a németek gyorsan erősítést küldenek. Az utánpótlás akadozik, a hídfőállásért vívott harc rendkívül véres és bizonytalan kimenetelű. A háború elhúzódik ezen a fronton.",
    "scenario_allies_europe_1944_outcome2_easy": "A Pas-de-Calais elleni támadás a vártnál erősebb német védelembe ütközik. A partraszállás súlyos veszteségekkel jár, de a közelség miatt az utánpótlás gyorsabb lehet, ha sikerül áttörni. A németeket meglepi a támadás iránya.",
    "scenario_allies_europe_1944_outcome2_normal": "A Pas-de-Calais elleni támadás rendkívül erős német védelemmel találkozik. A partraszállási kísérlet hatalmas veszteségekkel jár, a hídfőállás kialakítása kétséges, a hadművelet sikeressége megkérdőjeleződik.",
    "scenario_allies_europe_1944_outcome2_hard": "A Pas-de-Calais elleni támadás katasztrófába torkollik. A németek felkészülten várják a támadást, a partraszálló erők megsemmisítő vereséget szenvednek. A második front megnyitása jelentősen késik, és súlyos morális csapást mér a szövetségesekre.",
    "scenario_axis_eastern_front_1942_title": "Sztálingrád Dilemmája (Tengelyhatalmak, Keleti Front, 1942)",
    "scenario_axis_eastern_front_1942_desc": "1942 nyara. A német 6. Hadsereg Sztálingrád felé nyomul. A cél a Volga elérése és a kaukázusi olajmezők biztosítása. A városi harc azonban elhúzódik. Paulus tábornok jelentős erőket köt le a városban. Mit tanácsolsz a Főparancsnokságnak?",
    "scenario_axis_eastern_front_1942_choice1": "Folytatni Sztálingrád ostromát mindenáron, a város elfoglalása presztízskérdés.",
    "scenario_axis_eastern_front_1942_choice2": "Átcsoportosítani az erőket, bekeríteni Sztálingrádot, és dél felé, az olajmezők felé folytatni a fő támadást, mielőtt a tél beáll.",
    "scenario_axis_eastern_front_1942_outcome1_easy": "Sztálingrád ostroma folytatódik. A város nagy részét elfoglalják, a szovjetek visszavonulnak a Volga mögé. A kaukázusi olajmezők egy része elérhetővé válik, bár a tél nehezíti a műveleteket.",
    "scenario_axis_eastern_front_1942_outcome1_normal": "Sztálingrád ostroma elhúzódik, óriási veszteségeket okozva mindkét oldalon. A 6. Hadsereg csapdába esik, ahogy a szovjetek bekerítő hadműveletet indítanak. A kaukázusi offenzíva megakad.",
    "scenario_axis_eastern_front_1942_outcome1_hard": "Sztálingrád ostroma a német hadigépezet mészárszékévé válik. A 6. Hadsereg teljesen felmorzsolódik a városban, a bekerítésből nincs kiút. Ez a vereség fordulópontot jelent a keleti fronton, a német morál összeomlik.",
    "scenario_axis_eastern_front_1942_outcome2_easy": "Az erők átcsoportosítása lehetővé teszi a Kaukázus felé történő gyors előrenyomulást. Az olajmezőket sikerül biztosítani a tél beállta előtt. Sztálingrád blokád alatt marad, de nem köti le a fő erőket.",
    "scenario_axis_eastern_front_1942_outcome2_normal": "Az átcsoportosítás megosztja az erőket. Bár a kaukázusi előrenyomulás kezdetben sikeres, a szovjetek kihasználják a meggyengült sztálingrádi frontot egy ellentámadásra, ami súlyos helyzetbe hozza a német erőket. Az olajellátás bizonytalan.",
    "scenario_axis_eastern_front_1942_outcome2_hard": "Az átcsoportosítás túl későn és elégtelen erőkkel történik. A szovjetek mindkét irányban ellentámadást indítanak. Sztálingrádnál a német szárnyak összeomlanak, a kaukázusi előrenyomulás pedig elakad, súlyos, kettős fronton elszenvedett vereséget eredményezve.",
    "scenario_allies_pacific_1942_title": "Midway Előtt (Szövetségesek, Csendes-óceán, 1942)",
    "scenario_allies_pacific_1942_desc": "1942 májusa. Az amerikai hírszerzés feltörte a japán haditengerészeti kódokat, és tudomást szerzett egy nagyszabású japán támadásról Midway-szigetek ellen. A japán flotta fölényben van. Hogyan reagálj Nimitz admirális helyében?",
    "scenario_allies_pacific_1942_choice1": "Csapdát állítani a japán flottának Midwaynél, kihasználva a hírszerzési előnyt, még ha kockázatos is.",
    "scenario_allies_pacific_1942_choice2": "Védekező pozíciót felvenni, megkísérelni Midway védelmét a szigetről és a rendelkezésre álló kisebb flottával, elkerülve a döntő összecsapást.",
    "scenario_allies_pacific_1942_outcome1_easy": "A japán flotta belesétál a csapdába. Az amerikai repülőgép-hordozók döntő csapást mérnek a japán hordozókra. Midway megmenekül, a japán terjeszkedés megáll, a győzelem egyértelmű.",
    "scenario_allies_pacific_1942_outcome1_normal": "A midwayi csata rendkívül kiélezett. A hírszerzési előny döntőnek bizonyul, de az amerikaiak is súlyos veszteségeket szenvednek. Négy japán hordozó elsüllyesztése stratégiai győzelmet jelent.",
    "scenario_allies_pacific_1942_outcome1_hard": "A csapda részben működik, de a japánok is okoznak komoly károkat az amerikai flottában. A csata kimenetele sokáig kétséges. Végül az amerikaiak győznek, de a flotta jelentős része megsemmisül, a háború a Csendes-óceánon még évekig elhúzódik.",
    "scenario_allies_pacific_1942_outcome2_easy": "Midway védelme sikeres, de a japán flotta nagy része sértetlen marad. A japánok más célpontokat keresnek, a háború folytatódik a Csendes-óceánon, az USA időt nyer az építkezésre.",
    "scenario_allies_pacific_1942_outcome2_normal": "Midway védelme során súlyos harcok dúlnak. A sziget megmarad amerikai kézen, de a japán flotta nem szenved döntő vereséget, és továbbra is komoly fenyegetést jelent. A kezdeményezés nem kerül egyértelműen az USA kezébe.",
    "scenario_allies_pacific_1942_outcome2_hard": "A védekező stratégia nem elegendő. A japán flotta túlereje elsöpri Midway védelmét. A sziget elvesztése súlyos csapás az USA csendes-óceáni stratégiájára, és a japánok tovább terjeszkedhetnek Hawaii felé.",
    "scenario_axis_pacific_1941_title": "Pearl Harbor Után (Tengelyhatalmak, Csendes-óceán, 1941)",
    "scenario_axis_pacific_1941_desc": "1941. december. A Pearl Harbor elleni támadás sikeres volt, az amerikai csendes-óceáni flotta súlyos károkat szenvedett. Yamamoto admirálisnak döntenie kell a következő lépésről. Mi legyen a prioritás?",
    "scenario_axis_pacific_1941_choice1": "Gyors és agresszív terjeszkedés Délkelet-Ázsiában és a Csendes-óceánon, kihasználva a kezdeti előnyt (Fülöp-szigetek, Malájföld, Holland Kelet-India).",
    "scenario_axis_pacific_1941_choice2": "Az amerikai repülőgép-hordozók felkutatása és megsemmisítése, amelyek elkerülték a Pearl Harbor-i támadást, hogy teljes tengeri fölényt biztosítsanak.",
    "scenario_axis_pacific_1941_outcome1_easy": "A japán erők villámgyorsan elfoglalják Délkelet-Ázsia kulcsfontosságú területeit. Az erőforrásokban gazdag régiók biztosítása hosszú távú előnyt jelent Japánnak, az USA lassan reagál.",
    "scenario_axis_pacific_1941_outcome1_normal": "A terjeszkedés sikeres, de az amerikaiak és szövetségeseik elkeseredett ellenállást tanúsítanak. Az utánpótlási vonalak megnyúlnak, ami később problémát okozhat. A háború elhúzódóvá válik.",
    "scenario_axis_pacific_1941_outcome1_hard": "A gyors terjeszkedés túlságosan szétforgácsolja a japán erőket. Bár kezdeti sikereket érnek el, az elfoglalt területek megtartása és az ellenállás letörése rendkívül erőforrás-igényes. Az USA gyorsan ellentámadásba lendül.",
    "scenario_axis_pacific_1941_outcome2_easy": "A japán flotta sikeresen felkutatja és megsemmisíti az amerikai hordozókat. Japán teljes tengeri fölényre tesz szert a Csendes-óceánon, ami megkönnyíti a további terjeszkedést és egy esetleges kedvező béke kikényszerítését.",
    "scenario_axis_pacific_1941_outcome2_normal": "Az amerikai hordozók felkutatása nehéz és kockázatos vállalkozás. Egy vagy két hordozót sikerül elpusztítani, de a japán flotta is veszteségeket szenved. A tengeri fölény nem teljes, az USA továbbra is veszélyt jelent.",
    "scenario_axis_pacific_1941_outcome2_hard": "Az amerikai hordozók elkerülik a japán flottát, vagy egy meglepetésszerű összecsapásban súlyos veszteségeket okoznak a támadóknak (hasonlóan Midway-hez, csak fordított szereposztásban). A japán haditengerészet döntő csapásmérő képessége csökken, ami hátráltatja a háborús célok elérését.",
    "hungary_title": "Magyarország a II. Világháborúban",
    "hungary_intro": "Magyarország szerepe a II. világháborúban összetett és tragikus. Az ország kezdetben a tengelyhatalmak oldalán vett részt a konfliktusban, jelentős területi revíziókat elérve.",
    "hungary_p1": "A háború előrehaladtával azonban egyre súlyosabb veszteségeket szenvedett, és 1944-ben német megszállás alá került, majd a háború végén a szovjet érdekszférába.",
    "hungary_p2": "A magyarországi zsidóság tragédiája, a Holokauszt, szintén a korszak sötét fejezete. Az ország sorsa a háború után évtizedekre megpecsételődött."
  },
  "en": {
    "site_title": "WWII Simulator & Information",
    "main_heading": "World War II: History and Simulation",
    "nav_home": "Home",
    "nav_timeline": "Timeline",
    "nav_key_figures": "Key Figures",
    "nav_battles": "Battles",
    "nav_simulation": "Simulation",
    "nav_hungary": "Hungary in WWII",
    "home_title": "Welcome to the WWII Interactive Page!",
    "home_intro_1": "Explore the most defining conflict of the 20th century! This site provides insights into the events, figures, and consequences of World War II, based on a 7th-grade curriculum. Information is general; country-specific curricula may vary.",
    "home_intro_2": "Use the menu above to navigate, or set up the simulation and try the interactive part. Happy exploring!",
    "home_settings_title": "Simulation Settings",
    "home_settings_text": "Select the basic parameters for the simulation. These settings will affect the scenarios and interactions on the 'Simulation' tab.",
    "setting_side": "Choose a side:",
    "side_allies": "Allies",
    "side_axis": "Axis",
    "setting_focus": "Choose a theater:",
    "focus_europe": "Europe (Western Front)",
    "focus_eastern_front": "Eastern Front (Europe)",
    "focus_pacific": "Pacific",
    "setting_difficulty": "Choose difficulty:",
    "difficulty_easy": "Easy",
    "difficulty_normal": "Normal",
    "difficulty_hard": "Hard",
    "apply_settings_button": "Apply and Save Settings",
    "settings_applied_message": "Settings saved! Navigate to the Simulation tab.",
    "settings_not_set_simulation": "Please set the simulation parameters on the Homepage first to view the scenario!",
    "scenario_not_available": "No scenario is currently available for this combination of settings. Please choose different settings on the Homepage.",
    "timeline_title": "Timeline of World War II",
    "timeline_intro": "Follow the most important events of the war in chronological order.",
    "event_1939_09_01_date": "September 1, 1939",
    "event_1939_09_01_desc": "Germany invades Poland, marking the beginning of the war in Europe.",
    "event_1940_05_10_date": "May 10, 1940",
    "event_1940_05_10_desc": "German attack on France and the Benelux countries (blitzkrieg).",
    "event_1941_06_22_date": "June 22, 1941",
    "event_1941_06_22_desc": "Operation Barbarossa: Germany invades the Soviet Union.",
    "event_1941_12_07_date": "December 7, 1941",
    "event_1941_12_07_desc": "Japanese attack on Pearl Harbor; the USA enters the war.",
    "event_1944_06_06_date": "June 6, 1944",
    "event_1944_06_06_desc": "Normandy landings (D-Day), opening the Western Front.",
    "event_1945_05_08_date": "May 8, 1945",
    "event_1945_05_08_desc": "End of the war in Europe (VE Day).",
    "event_1945_09_02_date": "September 2, 1945",
    "event_1945_09_02_desc": "Japanese surrender, official end of World War II.",
    "key_figures_title": "Key Figures of the War",
    "key_figures_intro": "Meet the leaders and personalities who shaped the course of the war.",
    "figure_churchill_name": "Winston Churchill",
    "figure_churchill_role": "Prime Minister of Great Britain",
    "figure_churchill_desc": "A legendary orator who led his country's resistance against Nazi Germany.",
    "figure_roosevelt_name": "Franklin D. Roosevelt",
    "figure_roosevelt_role": "President of the United States",
    "figure_roosevelt_desc": "Led the USA for most of the war, played a key role in the Allied victory.",
    "figure_stalin_name": "Joseph Stalin",
    "figure_stalin_role": "Leader of the Soviet Union",
    "figure_stalin_desc": "A dictatorial leader whose country stopped the German advance on the Eastern Front at enormous cost.",
    "figure_hitler_name": "Adolf Hitler",
    "figure_hitler_role": "Führer of Germany",
    "figure_hitler_desc": "Leader of the Nazi party, primarily responsible for World War II and the Holocaust.",
    "battles_title": "Defining Battles",
    "battles_intro": "Learn about some of the most important and bloodiest battles of World War II.",
    "battle_stalingrad_name": "Battle of Stalingrad (1942-43)",
    "battle_stalingrad_desc": "A turning point on the Eastern Front. The Red Army stopped and turned back the German advance here.",
    "battle_normandy_name": "Normandy Landings (1944)",
    "battle_normandy_desc": "The Allied landings in France, which opened the Western Front and accelerated Germany's defeat.",
    "simulation_title": "Interactive Scenarios",
    "simulation_intro": "This section offers interactive scenarios based on the parameters set on the Homepage. Your decisions will influence the described outcome.",
    "simulation_current_settings_title": "Current Simulation Settings",
    "simulation_current_side": "Chosen Side",
    "simulation_current_focus": "Chosen Theater",
    "simulation_current_difficulty": "Chosen Difficulty",
    "simulation_scenario_title": "Scenario",
    "simulation_your_choice": "Your Choice:",
    "simulation_outcome_title": "Outcome:",
    "scenario_choose_option": "Choose an option to proceed:",
    "scenario_allies_europe_1944_title": "D-Day Preparations (Allies, Europe - Western Front, 1944)",
    "scenario_allies_europe_1944_desc": "Spring 1944. You are part of the Allied High Command in the final planning stages for the Normandy landings (Operation Overlord). Two main areas emerge as possible landing zones: the Normandy beaches or the Pas-de-Calais region, which is closer to England and Germany but more heavily defended. Intelligence is mixed. Where would you focus the main assault?",
    "scenario_allies_europe_1944_choice1": "Normandy: More surprising, but longer supply lines.",
    "scenario_allies_europe_1944_choice2": "Pas-de-Calais: Shorter route, but stronger German defenses expected.",
    "scenario_allies_europe_1944_outcome1_easy": "The Normandy landings surprise the Germans. Although supply is difficult, initial successes establish the beachhead. Casualties are moderate, the front opens quickly.",
    "scenario_allies_europe_1944_outcome1_normal": "The Normandy landings successfully surprise the Germans, but defenses are tough in places. Establishing supply lines is critical. Securing the beachhead requires significant effort but eventually stabilizes.",
    "scenario_allies_europe_1944_outcome1_hard": "The Normandy landings are initially successful due to surprise, but the Germans quickly send reinforcements. Supply lines falter, and the battle for the beachhead is extremely bloody and uncertain. The war on this front drags on.",
    "scenario_allies_europe_1944_outcome2_easy": "The attack on Pas-de-Calais meets stronger than expected German defenses. The landing incurs heavy casualties, but the proximity could allow for faster resupply if a breakthrough is achieved. The Germans are surprised by the direction of the attack.",
    "scenario_allies_europe_1944_outcome2_normal": "The attack on Pas-de-Calais encounters extremely strong German defenses. The landing attempt results in massive casualties, the establishment of a beachhead is doubtful, and the success of the operation is questioned.",
    "scenario_allies_europe_1944_outcome2_hard": "The attack on Pas-de-Calais turns into a disaster. The Germans are prepared and waiting, and the landing forces suffer a devastating defeat. The opening of the second front is significantly delayed, dealing a severe moral blow to the Allies.",
    "scenario_axis_eastern_front_1942_title": "Stalingrad Dilemma (Axis, Eastern Front, 1942)",
    "scenario_axis_eastern_front_1942_desc": "Summer 1942. The German 6th Army is advancing towards Stalingrad. The goal is to reach the Volga and secure the Caucasian oil fields. However, urban combat drags on. General Paulus has significant forces tied down in the city. What do you advise High Command?",
    "scenario_axis_eastern_front_1942_choice1": "Continue the siege of Stalingrad at all costs; capturing the city is a matter of prestige.",
    "scenario_axis_eastern_front_1942_choice2": "Regroup forces, encircle Stalingrad, and continue the main offensive south towards the oil fields before winter sets in.",
    "scenario_axis_eastern_front_1942_outcome1_easy": "The siege of Stalingrad continues. Most of the city is captured, the Soviets retreat behind the Volga. Some Caucasian oil fields become accessible, though winter complicates operations.",
    "scenario_axis_eastern_front_1942_outcome1_normal": "The siege of Stalingrad drags on, causing enormous casualties on both sides. The 6th Army becomes trapped as the Soviets launch an encirclement operation. The Caucasus offensive stalls.",
    "scenario_axis_eastern_front_1942_outcome1_hard": "The siege of Stalingrad becomes a slaughterhouse for the German war machine. The 6th Army is completely annihilated in the city, with no escape from the encirclement. This defeat marks a turning point on the Eastern Front, German morale collapses.",
    "scenario_axis_eastern_front_1942_outcome2_easy": "Regrouping forces allows for a swift advance towards the Caucasus. The oil fields are secured before winter. Stalingrad remains under blockade but doesn't tie down main forces.",
    "scenario_axis_eastern_front_1942_outcome2_normal": "Regrouping divides the forces. Although the Caucasus advance is initially successful, the Soviets exploit the weakened Stalingrad front for a counterattack, putting German forces in a dire situation. Oil supply is uncertain.",
    "scenario_axis_eastern_front_1942_outcome2_hard": "Regrouping is too late and with insufficient forces. The Soviets launch counterattacks in both directions. The German flanks at Stalingrad collapse, and the Caucasus advance grinds to a halt, resulting in a major defeat on two fronts.",
    "scenario_allies_pacific_1942_title": "Before Midway (Allies, Pacific, 1942)",
    "scenario_allies_pacific_1942_desc": "May 1942. US intelligence has broken Japanese naval codes and learned of a large-scale Japanese attack planned against Midway Island. The Japanese fleet is superior. How do you react in Admiral Nimitz's position?",
    "scenario_allies_pacific_1942_choice1": "Set a trap for the Japanese fleet at Midway, exploiting the intelligence advantage, even if risky.",
    "scenario_allies_pacific_1942_choice2": "Adopt a defensive posture, attempt to defend Midway from the island and with the smaller available fleet, avoiding a decisive engagement.",
    "scenario_allies_pacific_1942_outcome1_easy": "The Japanese fleet sails into the trap. US carrier aircraft deliver a decisive blow to Japanese carriers. Midway is saved, Japanese expansion is halted, the victory is clear.",
    "scenario_allies_pacific_1942_outcome1_normal": "The Battle of Midway is extremely close. The intelligence advantage proves decisive, but the Americans also suffer heavy losses. Sinking four Japanese carriers is a strategic victory.",
    "scenario_allies_pacific_1942_outcome1_hard": "The trap partially works, but the Japanese also inflict serious damage on the US fleet. The outcome of the battle is uncertain for a long time. Eventually, the Americans win, but a significant part of the fleet is destroyed, prolonging the war in the Pacific for years.",
    "scenario_allies_pacific_1942_outcome2_easy": "The defense of Midway is successful, but most of the Japanese fleet remains intact. The Japanese seek other targets, the war continues in the Pacific, the US gains time to build up.",
    "scenario_allies_pacific_1942_outcome2_normal": "Heavy fighting occurs during the defense of Midway. The island remains in US hands, but the Japanese fleet does not suffer a decisive defeat and continues to pose a serious threat. The initiative is not clearly in US hands.",
    "scenario_allies_pacific_1942_outcome2_hard": "The defensive strategy is insufficient. The superiority of the Japanese fleet overwhelms Midway's defenses. The loss of the island is a severe blow to US Pacific strategy, and the Japanese can advance further towards Hawaii.",
    "scenario_axis_pacific_1941_title": "After Pearl Harbor (Axis, Pacific, 1941)",
    "scenario_axis_pacific_1941_desc": "December 1941. The attack on Pearl Harbor was successful; the US Pacific Fleet suffered heavy damage. Admiral Yamamoto must decide on the next step. What should be the priority?",
    "scenario_axis_pacific_1941_choice1": "Rapid and aggressive expansion in Southeast Asia and the Pacific, exploiting the initial advantage (Philippines, Malaya, Dutch East Indies).",
    "scenario_axis_pacific_1941_choice2": "Hunting down and destroying the American aircraft carriers that escaped the Pearl Harbor attack to ensure complete naval supremacy.",
    "scenario_axis_pacific_1941_outcome1_easy": "Japanese forces swiftly capture key territories in Southeast Asia. Securing resource-rich regions provides a long-term advantage for Japan, the US is slow to react.",
    "scenario_axis_pacific_1941_outcome1_normal": "The expansion is successful, but the Americans and their allies put up desperate resistance. Supply lines become stretched, which may cause problems later. The war becomes protracted.",
    "scenario_axis_pacific_1941_outcome1_hard": "Rapid expansion overstretches Japanese forces. Although initial successes are achieved, holding the occupied territories and suppressing resistance is extremely resource-intensive. The US quickly launches a counter-offensive.",
    "scenario_axis_pacific_1941_outcome2_easy": "The Japanese fleet successfully hunts down and destroys the American carriers. Japan achieves complete naval supremacy in the Pacific, facilitating further expansion and potentially forcing a favorable peace.",
    "scenario_axis_pacific_1941_outcome2_normal": "Hunting down American carriers is a difficult and risky undertaking. One or two carriers are destroyed, but the Japanese fleet also suffers losses. Naval supremacy is not complete, the US remains a threat.",
    "scenario_axis_pacific_1941_outcome2_hard": "American carriers evade the Japanese fleet or, in a surprise engagement, inflict heavy losses on the attackers (similar to Midway, but roles reversed). The Japanese Navy's decisive strike capability is diminished, hindering war aims.",
    "hungary_title": "Hungary in World War II",
    "hungary_intro": "Hungary's role in World War II was complex and tragic. The country initially participated in the conflict on the side of the Axis powers, achieving significant territorial revisions.",
    "hungary_p1": "However, as the war progressed, it suffered increasingly heavy losses, and in 1944 it came under German occupation, then into the Soviet sphere of influence at the end of the war.",
    "hungary_p2": "The tragedy of Hungarian Jewry, the Holocaust, is also a dark chapter of the era. The country's fate was sealed for decades after the war."
  },
  "de": {
    "site_title": "WK2 Simulator & Informationen",
    "main_heading": "Zweiter Weltkrieg: Geschichte und Simulation",
    "nav_home": "Startseite",
    "nav_timeline": "Zeitleiste",
    "nav_key_figures": "Schlüsselfiguren",
    "nav_battles": "Schlachten",
    "nav_simulation": "Simulation",
    "nav_hungary": "Ungarn im 2. WK",
    "home_title": "Willkommen auf der interaktiven Seite zum Zweiten Weltkrieg!",
    "home_intro_1": "Entdecken Sie den prägendsten Konflikt des 20. Jahrhunderts! Diese Seite bietet Einblicke in die Ereignisse, Persönlichkeiten und Folgen des Zweiten Weltkriegs, basierend auf dem Lehrplan der 7. Klasse. Die Informationen sind allgemein gehalten, länderspezifische Lehrpläne können abweichen.",
    "home_intro_2": "Nutzen Sie das Menü oben zur Navigation oder richten Sie die Simulation ein und probieren Sie den interaktiven Teil aus. Viel Spaß beim Entdecken!",
    "home_settings_title": "Simulations-Einstellungen",
    "home_settings_text": "Wählen Sie die grundlegenden Parameter für die Simulation. Diese Einstellungen beeinflussen die Szenarien und Interaktionen auf der Registerkarte 'Simulation'.",
    "setting_side": "Wähle eine Seite:",
    "side_allies": "Alliierte",
    "side_axis": "Achsenmächte",
    "setting_focus": "Wähle einen Kriegsschauplatz:",
    "focus_europe": "Europa (Westfront)",
    "focus_eastern_front": "Ostfront (Europa)",
    "focus_pacific": "Pazifik",
    "setting_difficulty": "Wähle den Schwierigkeitsgrad:",
    "difficulty_easy": "Einfach",
    "difficulty_normal": "Normal",
    "difficulty_hard": "Schwer",
    "apply_settings_button": "Einstellungen Anwenden und Speichern",
    "settings_applied_message": "Einstellungen gespeichert! Navigieren Sie zur Registerkarte Simulation.",
    "settings_not_set_simulation": "Bitte stellen Sie zuerst die Simulationsparameter auf der Startseite ein, um das Szenario anzuzeigen!",
    "scenario_not_available": "Für diese Einstellungskombination ist derzeit kein Szenario verfügbar. Bitte wählen Sie auf der Startseite andere Einstellungen.",
    "timeline_title": "Zeitleiste des Zweiten Weltkriegs",
    "timeline_intro": "Verfolgen Sie die wichtigsten Ereignisse des Krieges in chronologischer Reihenfolge.",
    "event_1939_09_01_date": "1. September 1939",
    "event_1939_09_01_desc": "Deutschland überfällt Polen, Beginn des Krieges in Europa.",
    "event_1940_05_10_date": "10. Mai 1940",
    "event_1940_05_10_desc": "Deutscher Angriff auf Frankreich und die Benelux-Staaten (Blitzkrieg).",
    "event_1941_06_22_date": "22. Juni 1941",
    "event_1941_06_22_desc": "Unternehmen Barbarossa: Deutschland greift die Sowjetunion an.",
    "event_1941_12_07_date": "7. Dezember 1941",
    "event_1941_12_07_desc": "Japanischer Angriff auf Pearl Harbor; die USA treten in den Krieg ein.",
    "event_1944_06_06_date": "6. Juni 1944",
    "event_1944_06_06_desc": "Landung in der Normandie (D-Day), Eröffnung der Westfront.",
    "event_1945_05_08_date": "8. Mai 1945",
    "event_1945_05_08_desc": "Kriegsende in Europa (VE-Day).",
    "event_1945_09_02_date": "2. September 1945",
    "event_1945_09_02_desc": "Kapitulation Japans, offizielles Ende des Zweiten Weltkriegs.",
    "key_figures_title": "Schlüsselfiguren des Krieges",
    "key_figures_intro": "Lernen Sie die Führer und Persönlichkeiten kennen, die den Verlauf des Krieges geprägt haben.",
    "figure_churchill_name": "Winston Churchill",
    "figure_churchill_role": "Premierminister von Großbritannien",
    "figure_churchill_desc": "Ein legendärer Redner, der den Widerstand seines Landes gegen Nazi-Deutschland anführte.",
    "figure_roosevelt_name": "Franklin D. Roosevelt",
    "figure_roosevelt_role": "Präsident der Vereinigten Staaten",
    "figure_roosevelt_desc": "Führte die USA während des größten Teils des Krieges und spielte eine Schlüsselrolle beim Sieg der Alliierten.",
    "figure_stalin_name": "Josef Stalin",
    "figure_stalin_role": "Führer der Sowjetunion",
    "figure_stalin_desc": "Ein diktatorischer Führer, dessen Land den deutschen Vormarsch an der Ostfront unter enormen Opfern stoppte.",
    "figure_hitler_name": "Adolf Hitler",
    "figure_hitler_role": "Führer Deutschlands",
    "figure_hitler_desc": "Führer der NSDAP, hauptverantwortlich für den Zweiten Weltkrieg und den Holocaust.",
    "battles_title": "Entscheidende Schlachten",
    "battles_intro": "Erfahren Sie mehr über einige der wichtigsten und blutigsten Schlachten des Zweiten Weltkriegs.",
    "battle_stalingrad_name": "Schlacht von Stalingrad (1942-43)",
    "battle_stalingrad_desc": "Ein Wendepunkt an der Ostfront. Die Rote Armee stoppte hier den deutschen Vormarsch und drängte ihn zurück.",
    "battle_normandy_name": "Landung in der Normandie (1944)",
    "battle_normandy_desc": "Die Landung der Alliierten in Frankreich, die die Westfront eröffnete und die Niederlage Deutschlands beschleunigte.",
    "simulation_title": "Interaktive Szenarien",
    "simulation_intro": "Dieser Bereich bietet interaktive Szenarien basierend auf den auf der Startseite eingestellten Parametern. Ihre Entscheidungen beeinflussen das beschriebene Ergebnis.",
    "simulation_current_settings_title": "Aktuelle Simulationseinstellungen",
    "simulation_current_side": "Gewählte Seite",
    "simulation_current_focus": "Gewählter Kriegsschauplatz",
    "simulation_current_difficulty": "Gewählter Schwierigkeitsgrad",
    "simulation_scenario_title": "Szenario",
    "simulation_your_choice": "Ihre Wahl:",
    "simulation_outcome_title": "Ergebnis:",
    "scenario_choose_option": "Wähle eine Option, um fortzufahren:",
    "scenario_allies_europe_1944_title": "D-Day Vorbereitungen (Alliierte, Europa - Westfront, 1944)",
    "scenario_allies_europe_1944_desc": "Frühjahr 1944. Sie sind Teil des Alliierten Oberkommandos in der Endphase der Planung für die Landung in der Normandie (Operation Overlord). Zwei Hauptgebiete kristallisieren sich als mögliche Landezonen heraus: die Strände der Normandie oder die Region Pas-de-Calais, die näher an England und Deutschland liegt, aber stärker verteidigt wird. Die Geheimdienstinformationen sind gemischt. Wo würden Sie den Hauptangriff konzentrieren?",
    "scenario_allies_europe_1944_choice1": "Normandie: Überraschender, aber längere Nachschubwege.",
    "scenario_allies_europe_1944_choice2": "Pas-de-Calais: Kürzerer Weg, aber stärkere deutsche Verteidigung erwartet.",
    "scenario_allies_europe_1944_outcome1_easy": "Die Landung in der Normandie überrascht die Deutschen. Obwohl der Nachschub schwierig ist, legen erste Erfolge den Grundstein für den Brückenkopf. Die Verluste sind moderat, die Front öffnet sich schnell.",
    "scenario_allies_europe_1944_outcome1_normal": "Die Landung in der Normandie überrascht die Deutschen erfolgreich, aber die Verteidigung ist stellenweise hart. Der Aufbau von Nachschubwegen ist entscheidend. Die Sicherung des Brückenkopfes erfordert erhebliche Anstrengungen, stabilisiert sich aber schließlich.",
    "scenario_allies_europe_1944_outcome1_hard": "Die Landung in der Normandie ist anfangs aufgrund der Überraschung erfolgreich, aber die Deutschen schicken schnell Verstärkung. Die Nachschubwege stocken, und der Kampf um den Brückenkopf ist extrem blutig und ungewiss. Der Krieg an dieser Front zieht sich hin.",
    "scenario_allies_europe_1944_outcome2_easy": "Der Angriff auf Pas-de-Calais stößt auf stärkere deutsche Verteidigung als erwartet. Die Landung verursacht hohe Verluste, aber die Nähe könnte einen schnelleren Nachschub ermöglichen, wenn ein Durchbruch gelingt. Die Deutschen sind von der Angriffsrichtung überrascht.",
    "scenario_allies_europe_1944_outcome2_normal": "Der Angriff auf Pas-de-Calais trifft auf extrem starke deutsche Verteidigung. Der Landungsversuch führt zu massiven Verlusten, die Errichtung eines Brückenkopfes ist zweifelhaft, und der Erfolg der Operation wird in Frage gestellt.",
    "scenario_allies_europe_1944_outcome2_hard": "Der Angriff auf Pas-de-Calais endet in einer Katastrophe. Die Deutschen sind vorbereitet und warten, und die Landungstruppen erleiden eine verheerende Niederlage. Die Eröffnung der zweiten Front verzögert sich erheblich und versetzt den Alliierten einen schweren moralischen Schlag.",
    "scenario_axis_eastern_front_1942_title": "Stalingrad-Dilemma (Achsenmächte, Ostfront, 1942)",
    "scenario_axis_eastern_front_1942_desc": "Sommer 1942. Die deutsche 6. Armee rückt auf Stalingrad vor. Ziel ist es, die Wolga zu erreichen und die kaukasischen Ölfelder zu sichern. Der Häuserkampf zieht sich jedoch hin. General Paulus bindet erhebliche Kräfte in der Stadt. Was raten Sie dem Oberkommando?",
    "scenario_axis_eastern_front_1942_choice1": "Die Belagerung Stalingrads um jeden Preis fortsetzen; die Einnahme der Stadt ist eine Prestigefrage.",
    "scenario_axis_eastern_front_1942_choice2": "Kräfte umgruppieren, Stalingrad einkesseln und die Hauptoffensive nach Süden zu den Ölfeldern fortsetzen, bevor der Winter einbricht.",
    "scenario_axis_eastern_front_1942_outcome1_easy": "Die Belagerung Stalingrads geht weiter. Der größte Teil der Stadt wird eingenommen, die Sowjets ziehen sich hinter die Wolga zurück. Einige kaukasische Ölfelder werden zugänglich, obwohl der Winter die Operationen erschwert.",
    "scenario_axis_eastern_front_1942_outcome1_normal": "Die Belagerung Stalingrads zieht sich hin und fordert auf beiden Seiten enorme Verluste. Die 6. Armee wird eingeschlossen, als die Sowjets eine Umfassungsoperation starten. Die Kaukasus-Offensive stockt.",
    "scenario_axis_eastern_front_1942_outcome1_hard": "Die Belagerung Stalingrads wird zum Schlachthaus der deutschen Kriegsmaschine. Die 6. Armee wird in der Stadt vollständig vernichtet, es gibt kein Entrinnen aus der Einkesselung. Diese Niederlage bedeutet einen Wendepunkt an der Ostfront, die deutsche Moral bricht zusammen.",
    "scenario_axis_eastern_front_1942_outcome2_easy": "Die Umgruppierung der Kräfte ermöglicht einen schnellen Vorstoß in den Kaukasus. Die Ölfelder werden vor Wintereinbruch gesichert. Stalingrad bleibt unter Blockade, bindet aber keine Hauptkräfte.",
    "scenario_axis_eastern_front_1942_outcome2_normal": "Die Umgruppierung teilt die Kräfte. Obwohl der Vorstoß in den Kaukasus anfangs erfolgreich ist, nutzen die Sowjets die geschwächte Stalingrader Front für einen Gegenangriff, der die deutschen Truppen in eine schwierige Lage bringt. Die Ölversorgung ist unsicher.",
    "scenario_axis_eastern_front_1942_outcome2_hard": "Die Umgruppierung erfolgt zu spät und mit unzureichenden Kräften. Die Sowjets starten Gegenangriffe in beide Richtungen. Die deutschen Flanken bei Stalingrad brechen zusammen, und der Kaukasus-Vorstoß gerät ins Stocken, was zu einer schweren Niederlage an zwei Fronten führt.",
    "scenario_allies_pacific_1942_title": "Vor Midway (Alliierte, Pazifik, 1942)",
    "scenario_allies_pacific_1942_desc": "Mai 1942. Der US-Geheimdienst hat japanische Marinecodes geknackt und von einem großangelegten japanischen Angriff auf die Midway-Inseln erfahren. Die japanische Flotte ist überlegen. Wie reagieren Sie an Admiral Nimitz' Stelle?",
    "scenario_allies_pacific_1942_choice1": "Der japanischen Flotte bei Midway eine Falle stellen und den Geheimdienstvorteil nutzen, auch wenn es riskant ist.",
    "scenario_allies_pacific_1942_choice2": "Eine Verteidigungsposition einnehmen, versuchen, Midway von der Insel aus und mit der kleineren verfügbaren Flotte zu verteidigen und eine Entscheidungsschlacht vermeiden.",
    "scenario_allies_pacific_1942_outcome1_easy": "Die japanische Flotte tappt in die Falle. US-Trägerflugzeuge versetzen den japanischen Trägern einen entscheidenden Schlag. Midway ist gerettet, die japanische Expansion gestoppt, der Sieg ist eindeutig.",
    "scenario_allies_pacific_1942_outcome1_normal": "Die Schlacht um Midway ist extrem knapp. Der Geheimdienstvorteil erweist sich als entscheidend, aber auch die Amerikaner erleiden schwere Verluste. Die Versenkung von vier japanischen Trägern ist ein strategischer Sieg.",
    "scenario_allies_pacific_1942_outcome1_hard": "Die Falle funktioniert teilweise, aber auch die Japaner verursachen schwere Schäden in der US-Flotte. Der Ausgang der Schlacht ist lange ungewiss. Schließlich gewinnen die Amerikaner, aber ein erheblicher Teil der Flotte wird zerstört, was den Krieg im Pazifik um Jahre verlängert.",
    "scenario_allies_pacific_1942_outcome2_easy": "Die Verteidigung von Midway ist erfolgreich, aber der größte Teil der japanischen Flotte bleibt intakt. Die Japaner suchen nach anderen Zielen, der Krieg im Pazifik geht weiter, die USA gewinnen Zeit zum Aufbau.",
    "scenario_allies_pacific_1942_outcome2_normal": "Während der Verteidigung von Midway kommt es zu schweren Kämpfen. Die Insel bleibt in US-Hand, aber die japanische Flotte erleidet keine entscheidende Niederlage und stellt weiterhin eine ernste Bedrohung dar. Die Initiative liegt nicht eindeutig bei den USA.",
    "scenario_allies_pacific_1942_outcome2_hard": "Die Verteidigungsstrategie ist unzureichend. Die Überlegenheit der japanischen Flotte überwältigt die Verteidigung von Midway. Der Verlust der Insel ist ein schwerer Schlag für die US-Pazifikstrategie, und die Japaner können weiter in Richtung Hawaii vordringen.",
    "scenario_axis_pacific_1941_title": "Nach Pearl Harbor (Achsenmächte, Pazifik, 1941)",
    "scenario_axis_pacific_1941_desc": "Dezember 1941. Der Angriff auf Pearl Harbor war erfolgreich; die US-Pazifikflotte erlitt schwere Schäden. Admiral Yamamoto muss über den nächsten Schritt entscheiden. Was sollte Priorität haben?",
    "scenario_axis_pacific_1941_choice1": "Schnelle und aggressive Expansion in Südostasien und im Pazifik unter Ausnutzung des anfänglichen Vorteils (Philippinen, Malaya, Niederländisch-Indien).",
    "scenario_axis_pacific_1941_choice2": "Jagd auf und Zerstörung der amerikanischen Flugzeugträger, die dem Angriff auf Pearl Harbor entkommen sind, um die vollständige Seeherrschaft zu sichern.",
    "scenario_axis_pacific_1941_outcome1_easy": "Japanische Streitkräfte erobern blitzschnell Schlüsselgebiete in Südostasien. Die Sicherung ressourcenreicher Regionen verschafft Japan einen langfristigen Vorteil, die USA reagieren langsam.",
    "scenario_axis_pacific_1941_outcome1_normal": "Die Expansion ist erfolgreich, aber die Amerikaner und ihre Verbündeten leisten erbitterten Widerstand. Die Nachschublinien werden überdehnt, was später zu Problemen führen kann. Der Krieg zieht sich in die Länge.",
    "scenario_axis_pacific_1941_outcome1_hard": "Die schnelle Expansion überdehnt die japanischen Streitkräfte. Obwohl anfängliche Erfolge erzielt werden, ist die Sicherung der besetzten Gebiete und die Niederschlagung des Widerstands extrem ressourcenintensiv. Die USA starten schnell eine Gegenoffensive.",
    "scenario_axis_pacific_1941_outcome2_easy": "Die japanische Flotte jagt und zerstört erfolgreich die amerikanischen Träger. Japan erlangt die vollständige Seeherrschaft im Pazifik, was die weitere Expansion erleichtert und möglicherweise einen günstigen Frieden erzwingt.",
    "scenario_axis_pacific_1941_outcome2_normal": "Die Jagd auf amerikanische Träger ist ein schwieriges und riskantes Unterfangen. Ein oder zwei Träger werden zerstört, aber auch die japanische Flotte erleidet Verluste. Die Seeherrschaft ist nicht vollständig, die USA bleiben eine Bedrohung.",
    "scenario_axis_pacific_1941_outcome2_hard": "Amerikanische Träger entkommen der japanischen Flotte oder fügen den Angreifern in einem Überraschungsgefecht schwere Verluste zu (ähnlich wie Midway, nur mit vertauschten Rollen). Die entscheidende Schlagkraft der japanischen Marine wird geschwächt, was die Kriegsziele behindert.",
    "hungary_title": "Ungarn im Zweiten Weltkrieg",
    "hungary_intro": "Die Rolle Ungarns im Zweiten Weltkrieg war komplex und tragisch. Das Land nahm zunächst auf der Seite der Achsenmächte am Konflikt teil und erreichte bedeutende territoriale Revisionen.",
    "hungary_p1": "Im weiteren Verlauf des Krieges erlitt es jedoch immer schwerere Verluste und geriet 1944 unter deutsche Besatzung, um am Kriegsende in die sowjetische Einflusssphäre zu gelangen.",
    "hungary_p2": "Die Tragödie des ungarischen Judentums, der Holocaust, ist ebenfalls ein dunkles Kapitel dieser Ära. Das Schicksal des Landes war nach dem Krieg für Jahrzehnte besiegelt."
  },
  "es": {
    "site_title": "Simulador e Información de la II Guerra Mundial",
    "main_heading": "Segunda Guerra Mundial: Historia y Simulación",
    "nav_home": "Inicio",
    "nav_timeline": "Cronología",
    "nav_key_figures": "Personajes Clave",
    "nav_battles": "Batallas",
    "nav_simulation": "Simulación",
    "nav_hungary": "Hungría en la SGM",
    "home_title": "¡Bienvenido a la Página Interactiva de la Segunda Guerra Mundial!",
    "home_intro_1": "¡Explora el conflicto más definitorio del siglo XX! Este sitio proporciona información sobre los eventos, personajes y consecuencias de la Segunda Guerra Mundial, basado en un plan de estudios de séptimo grado. La información es general; los planes de estudio específicos de cada país pueden variar.",
    "home_intro_2": "Usa el menú de arriba para navegar, o configura la simulación y prueba la parte interactiva. ¡Feliz exploración!",
    "home_settings_title": "Configuración de Simulación",
    "home_settings_text": "Seleccione los parámetros básicos para la simulación. Esta configuración afectará los escenarios y las interacciones en la pestaña 'Simulación'.",
    "setting_side": "Elige un bando:",
    "side_allies": "Aliados",
    "side_axis": "Eje",
    "setting_focus": "Elige un teatro de operaciones:",
    "focus_europe": "Europa (Frente Occidental)",
    "focus_eastern_front": "Frente Oriental (Europa)",
    "focus_pacific": "Pacífico",
    "setting_difficulty": "Elige la dificultad:",
    "difficulty_easy": "Fácil",
    "difficulty_normal": "Normal",
    "difficulty_hard": "Difícil",
    "apply_settings_button": "Aplicar y Guardar Configuración",
    "settings_applied_message": "¡Configuración guardada! Navegue a la pestaña Simulación.",
    "settings_not_set_simulation": "¡Por favor, configure primero los parámetros de simulación en la página de inicio para ver el escenario!",
    "scenario_not_available": "Actualmente no hay ningún escenario disponible para esta combinación de ajustes. Por favor, elija diferentes ajustes en la página de inicio.",
    "timeline_title": "Cronología de la Segunda Guerra Mundial",
    "timeline_intro": "Sigue los eventos más importantes de la guerra en orden cronológico.",
    "event_1939_09_01_date": "1 de Septiembre de 1939",
    "event_1939_09_01_desc": "Alemania invade Polonia, marcando el inicio de la guerra en Europa.",
    "event_1940_05_10_date": "10 de Mayo de 1940",
    "event_1940_05_10_desc": "Ataque alemán a Francia y los países del Benelux (guerra relámpago).",
    "event_1941_06_22_date": "22 de Junio de 1941",
    "event_1941_06_22_desc": "Operación Barbarroja: Alemania invade la Unión Soviética.",
    "event_1941_12_07_date": "7 de Diciembre de 1941",
    "event_1941_12_07_desc": "Ataque japonés a Pearl Harbor; Estados Unidos entra en la guerra.",
    "event_1944_06_06_date": "6 de Junio de 1944",
    "event_1944_06_06_desc": "Desembarco de Normandía (Día D), apertura del Frente Occidental.",
    "event_1945_05_08_date": "8 de Mayo de 1945",
    "event_1945_05_08_desc": "Fin de la guerra en Europa (Día de la Victoria en Europa).",
    "event_1945_09_02_date": "2 de Septiembre de 1945",
    "event_1945_09_02_desc": "Rendición de Japón, fin oficial de la Segunda Guerra Mundial.",
    "key_figures_title": "Personajes Clave de la Guerra",
    "key_figures_intro": "Conoce a los líderes y personalidades que dieron forma al curso de la guerra.",
    "figure_churchill_name": "Winston Churchill",
    "figure_churchill_role": "Primer Ministro de Gran Bretaña",
    "figure_churchill_desc": "Un orador legendario que lideró la resistencia de su país contra la Alemania nazi.",
    "figure_roosevelt_name": "Franklin D. Roosevelt",
    "figure_roosevelt_role": "Presidente de los Estados Unidos",
    "figure_roosevelt_desc": "Lideró a EE. UU. durante la mayor parte de la guerra, desempeñó un papel clave en la victoria aliada.",
    "figure_stalin_name": "Iósif Stalin",
    "figure_stalin_role": "Líder de la Unión Soviética",
    "figure_stalin_desc": "Un líder dictatorial cuyo país detuvo el avance alemán en el Frente Oriental a un costo enorme.",
    "figure_hitler_name": "Adolf Hitler",
    "figure_hitler_role": "Führer de Alemania",
    "figure_hitler_desc": "Líder del partido nazi, principal responsable de la Segunda Guerra Mundial y el Holocausto.",
    "battles_title": "Batallas Decisivas",
    "battles_intro": "Aprende sobre algunas de las batallas más importantes y sangrientas de la Segunda Guerra Mundial.",
    "battle_stalingrad_name": "Batalla de Stalingrado (1942-43)",
    "battle_stalingrad_desc": "Un punto de inflexión en el Frente Oriental. El Ejército Rojo detuvo y revirtió el avance alemán aquí.",
    "battle_normandy_name": "Desembarco de Normandía (1944)",
    "battle_normandy_desc": "El desembarco aliado en Francia, que abrió el Frente Occidental y aceleró la derrota de Alemania.",
    "simulation_title": "Escenarios Interactivos",
    "simulation_intro": "Esta sección ofrece escenarios interactivos basados en los parámetros establecidos en la página de inicio. Tus decisiones influirán en el resultado descrito.",
    "simulation_current_settings_title": "Configuración Actual de Simulación",
    "simulation_current_side": "Bando Elegido",
    "simulation_current_focus": "Teatro Elegido",
    "simulation_current_difficulty": "Dificultad Elegida",
    "simulation_scenario_title": "Escenario",
    "simulation_your_choice": "Tu Elección:",
    "simulation_outcome_title": "Resultado:",
    "scenario_choose_option": "Elige una opción para continuar:",
    "scenario_allies_europe_1944_title": "Preparativos del Día D (Aliados, Europa - Frente Occidental, 1944)",
    "scenario_allies_europe_1944_desc": "Primavera de 1944. Eres parte del Alto Mando Aliado en las etapas finales de planificación para los desembarcos de Normandía (Operación Overlord). Surgen dos áreas principales como posibles zonas de desembarco: las playas de Normandía o la región de Pas-de-Calais, que está más cerca de Inglaterra y Alemania pero más fuertemente defendida. La inteligencia es mixta. ¿Dónde concentrarías el asalto principal?",
    "scenario_allies_europe_1944_choice1": "Normandía: Más sorprendente, pero líneas de suministro más largas.",
    "scenario_allies_europe_1944_choice2": "Pas-de-Calais: Ruta más corta, pero se esperan defensas alemanas más fuertes.",
    "scenario_allies_europe_1944_outcome1_easy": "Los desembarcos de Normandía sorprenden a los alemanes. Aunque el suministro es difícil, los éxitos iniciales establecen la cabeza de playa. Las bajas son moderadas, el frente se abre rápidamente.",
    "scenario_allies_europe_1944_outcome1_normal": "Los desembarcos de Normandía sorprenden con éxito a los alemanes, pero las defensas son duras en algunos lugares. Establecer líneas de suministro es crítico. Asegurar la cabeza de playa requiere un esfuerzo significativo pero finalmente se estabiliza.",
    "scenario_allies_europe_1944_outcome1_hard": "Los desembarcos de Normandía son inicialmente exitosos debido a la sorpresa, pero los alemanes envían refuerzos rápidamente. Las líneas de suministro flaquean, y la batalla por la cabeza de playa es extremadamente sangrienta e incierta. La guerra en este frente se prolonga.",
    "scenario_allies_europe_1944_outcome2_easy": "El ataque a Pas-de-Calais se encuentra con defensas alemanas más fuertes de lo esperado. El desembarco incurre en fuertes bajas, pero la proximidad podría permitir un reabastecimiento más rápido si se logra un avance. Los alemanes se sorprenden por la dirección del ataque.",
    "scenario_allies_europe_1944_outcome2_normal": "El ataque a Pas-de-Calais se encuentra con defensas alemanas extremadamente fuertes. El intento de desembarco resulta en bajas masivas, el establecimiento de una cabeza de playa es dudoso y el éxito de la operación se cuestiona.",
    "scenario_allies_europe_1944_outcome2_hard": "El ataque a Pas-de-Calais se convierte en un desastre. Los alemanes están preparados y esperando, y las fuerzas de desembarco sufren una derrota devastadora. La apertura del segundo frente se retrasa significativamente, asestando un duro golpe moral a los Aliados.",
    "scenario_axis_eastern_front_1942_title": "Dilema de Stalingrado (Eje, Frente Oriental, 1942)",
    "scenario_axis_eastern_front_1942_desc": "Verano de 1942. El 6º Ejército alemán avanza hacia Stalingrado. El objetivo es alcanzar el Volga y asegurar los campos petrolíferos del Cáucaso. Sin embargo, el combate urbano se prolonga. El general Paulus tiene fuerzas significativas atrapadas en la ciudad. ¿Qué aconsejas al Alto Mando?",
    "scenario_axis_eastern_front_1942_choice1": "Continuar el asedio de Stalingrado a toda costa; capturar la ciudad es una cuestión de prestigio.",
    "scenario_axis_eastern_front_1942_choice2": "Reagrupar fuerzas, rodear Stalingrado y continuar la ofensiva principal hacia el sur, hacia los campos petrolíferos, antes de que llegue el invierno.",
    "scenario_axis_eastern_front_1942_outcome1_easy": "El asedio de Stalingrado continúa. La mayor parte de la ciudad es capturada, los soviéticos se retiran detrás del Volga. Algunos campos petrolíferos del Cáucaso se vuelven accesibles, aunque el invierno complica las operaciones.",
    "scenario_axis_eastern_front_1942_outcome1_normal": "El asedio de Stalingrado se prolonga, causando enormes bajas en ambos bandos. El 6º Ejército queda atrapado cuando los soviéticos lanzan una operación de cerco. La ofensiva del Cáucaso se detiene.",
    "scenario_axis_eastern_front_1942_outcome1_hard": "El asedio de Stalingrado se convierte en un matadero para la maquinaria de guerra alemana. El 6º Ejército es completamente aniquilado en la ciudad, sin escapatoria del cerco. Esta derrota marca un punto de inflexión en el Frente Oriental, la moral alemana se derrumba.",
    "scenario_axis_eastern_front_1942_outcome2_easy": "La reagrupación de fuerzas permite un rápido avance hacia el Cáucaso. Los campos petrolíferos se aseguran antes del invierno. Stalingrado permanece bajo bloqueo pero no ata a las fuerzas principales.",
    "scenario_axis_eastern_front_1942_outcome2_normal": "La reagrupación divide las fuerzas. Aunque el avance del Cáucaso es inicialmente exitoso, los soviéticos explotan el debilitado frente de Stalingrado para un contraataque, poniendo a las fuerzas alemanas en una situación desesperada. El suministro de petróleo es incierto.",
    "scenario_axis_eastern_front_1942_outcome2_hard": "La reagrupación es demasiado tardía y con fuerzas insuficientes. Los soviéticos lanzan contraataques en ambas direcciones. Los flancos alemanes en Stalingrado colapsan, y el avance del Cáucaso se detiene, resultando en una grave derrota en dos frentes.",
    "scenario_allies_pacific_1942_title": "Antes de Midway (Aliados, Pacífico, 1942)",
    "scenario_allies_pacific_1942_desc": "Mayo de 1942. La inteligencia estadounidense ha descifrado los códigos navales japoneses y se ha enterado de un ataque japonés a gran escala planeado contra la isla de Midway. La flota japonesa es superior. ¿Cómo reaccionas en la posición del Almirante Nimitz?",
    "scenario_allies_pacific_1942_choice1": "Tender una trampa a la flota japonesa en Midway, explotando la ventaja de inteligencia, incluso si es arriesgado.",
    "scenario_allies_pacific_1942_choice2": "Adoptar una postura defensiva, intentar defender Midway desde la isla y con la flota más pequeña disponible, evitando un enfrentamiento decisivo.",
    "scenario_allies_pacific_1942_outcome1_easy": "La flota japonesa cae en la trampa. Los aviones de los portaaviones estadounidenses asestan un golpe decisivo a los portaaviones japoneses. Midway se salva, la expansión japonesa se detiene, la victoria es clara.",
    "scenario_allies_pacific_1942_outcome1_normal": "La Batalla de Midway es extremadamente reñida. La ventaja de inteligencia resulta decisiva, pero los estadounidenses también sufren grandes pérdidas. Hundir cuatro portaaviones japoneses es una victoria estratégica.",
    "scenario_allies_pacific_1942_outcome1_hard": "La trampa funciona parcialmente, pero los japoneses también infligen graves daños a la flota estadounidense. El resultado de la batalla es incierto durante mucho tiempo. Finalmente, los estadounidenses ganan, pero una parte significativa de la flota es destruida, prolongando la guerra en el Pacífico durante años.",
    "scenario_allies_pacific_1942_outcome2_easy": "La defensa de Midway tiene éxito, pero la mayor parte de la flota japonesa permanece intacta. Los japoneses buscan otros objetivos, la guerra continúa en el Pacífico, EE. UU. gana tiempo para fortalecerse.",
    "scenario_allies_pacific_1942_outcome2_normal": "Se producen intensos combates durante la defensa de Midway. La isla permanece en manos estadounidenses, pero la flota japonesa no sufre una derrota decisiva y sigue representando una seria amenaza. La iniciativa no está claramente en manos de EE. UU.",
    "scenario_allies_pacific_1942_outcome2_hard": "La estrategia defensiva es insuficiente. La superioridad de la flota japonesa arrasa las defensas de Midway. La pérdida de la isla es un duro golpe para la estrategia estadounidense en el Pacífico, y los japoneses pueden avanzar más hacia Hawái.",
    "scenario_axis_pacific_1941_title": "Después de Pearl Harbor (Eje, Pacífico, 1941)",
    "scenario_axis_pacific_1941_desc": "Diciembre de 1941. El ataque a Pearl Harbor fue un éxito; la flota estadounidense del Pacífico sufrió graves daños. El almirante Yamamoto debe decidir el siguiente paso. ¿Cuál debería ser la prioridad?",
    "scenario_axis_pacific_1941_choice1": "Expansión rápida y agresiva en el sudeste asiático y el Pacífico, aprovechando la ventaja inicial (Filipinas, Malasia, Indias Orientales Holandesas).",
    "scenario_axis_pacific_1941_choice2": "Cazar y destruir los portaaviones estadounidenses que escaparon del ataque a Pearl Harbor para asegurar la supremacía naval completa.",
    "scenario_axis_pacific_1941_outcome1_easy": "Las fuerzas japonesas capturan rápidamente territorios clave en el sudeste asiático. Asegurar regiones ricas en recursos proporciona una ventaja a largo plazo para Japón, EE. UU. tarda en reaccionar.",
    "scenario_axis_pacific_1941_outcome1_normal": "La expansión tiene éxito, pero los estadounidenses y sus aliados oponen una resistencia desesperada. Las líneas de suministro se alargan, lo que puede causar problemas más adelante. La guerra se vuelve prolongada.",
    "scenario_axis_pacific_1941_outcome1_hard": "La rápida expansión dispersa demasiado las fuerzas japonesas. Aunque se logran éxitos iniciales, mantener los territorios ocupados y sofocar la resistencia consume muchos recursos. EE. UU. lanza rápidamente una contraofensiva.",
    "scenario_axis_pacific_1941_outcome2_easy": "La flota japonesa caza y destruye con éxito los portaaviones estadounidenses. Japón logra la supremacía naval completa en el Pacífico, lo que facilita una mayor expansión y potencialmente obliga a una paz favorable.",
    "scenario_axis_pacific_1941_outcome2_normal": "Cazar portaaviones estadounidenses es una empresa difícil y arriesgada. Se destruyen uno o dos portaaviones, pero la flota japonesa también sufre pérdidas. La supremacía naval no es completa, EE. UU. sigue siendo una amenaza.",
    "scenario_axis_pacific_1941_outcome2_hard": "Los portaaviones estadounidenses evaden a la flota japonesa o, en un enfrentamiento sorpresa, infligen grandes pérdidas a los atacantes (similar a Midway, pero con los papeles invertidos). La capacidad de ataque decisivo de la Armada japonesa disminuye, lo que dificulta los objetivos de guerra.",
    "hungary_title": "Hungría en la Segunda Guerra Mundial",
    "hungary_intro": "El papel de Hungría en la Segunda Guerra Mundial fue complejo y trágico. El país participó inicialmente en el conflicto del lado de las potencias del Eje, logrando importantes revisiones territoriales.",
    "hungary_p1": "Sin embargo, a medida que avanzaba la guerra, sufrió pérdidas cada vez más graves y en 1944 quedó bajo ocupación alemana, para luego pasar a la esfera de influencia soviética al final de la guerra.",
    "hungary_p2": "La tragedia de la judería húngara, el Holocausto, es también un capítulo oscuro de la época. El destino del país quedó sellado durante décadas después de la guerra."
  }
}